import 'package:flutter/material.dart';

class WhoLostQuest extends StatelessWidget {
  WhoLostQuest({super.key});

  final List<Map<String, String>> faqs = [
    {
      "question": "ماذا لو خُلق الإنسان من دون إصبع الإبهام؟",
      "answer":
          "ستصبح حياتنا أصعب؛ لأننا سنواجه صعوبة في الإمساك بالأشياء واستخدام الأدوات",
    },
    {
      "question": "هل سنستطيع الكتابة بالقلم بسهولة؟ ولماذا؟",
      "answer":
          "لا، لأن الإبهام يساعد على تثبيت القلم والتحكم به أثناء الكتابة.",
    },
    {
      "question": "كيف سنمسك كأس الماء أو زجاجة العصير؟",
      "answer": "سيكون الإمساك بهما صعبًا وقد يسقطان من أيدينا بسهولة",
    },
    {
      "question":
          "هل سنتمكن من استخدام الملعقة أو الشوكة أو عيدان الطعام بسهولة؟",
      "answer": "لا، لأن الإبهام يساعد على القبض على أدوات الطعام والتحكم بها",
    },
    {
      "question": "كيف سنستخدم الهاتف المحمول أو لوحة المفاتيح؟",
      "answer":
          "سيكون الاستخدام أبطأ وأصعب، خاصة في الضغط على الأزرار أو الإمساك بالهاتف",
    },
    {
      "question": "ما المهن التي ستصبح أكثر صعوبة إذا لم يكن لدينا إبهام؟",
      "answer":
          "مثل النجار، والجراح، والخياط، والرسام، والنقاش، والحرفي؛ لأنهم يحتاجون إلى دقة في استخدام أيديهم",
    },
    {
      "question":
          "كيف سيؤثر غياب الإبهام في الرسم أو الحرف اليدوية أو المهام اليومية؟",
      "answer":
          "سيصبح أداء هذه الأعمال أصعب؛ لأن الإمساك بالأدوات والتحكم بها يحتاج إلى الإبهام",
    },
    {
      "question":
          "لماذا يُعد الإبهام من أهم أصابع اليد في القبض على الأشياء بإحكام؟",
      "answer":
          "لأنه يقابل بقية الأصابع، فيساعد على الإمساك بالأشياء بقوة ودقة.",
    },
    {
      "question":
          "كيف كانت ستتغير حياة الإنسان وتطوره الحضاري لو لم يُخلق بالإبهام؟",
      "answer":
          "كان سيصعب عليه صنع الأدوات والكتابة والبناء والاختراعات، لذلك سيتأخر تطور الحضارة..",
    },
    {
      "question":
          "ماذا تعلمنا هذه النعمة عن دقة خلق الله تعالى، وكيف نشكره عليها؟",
      "answer":
          "نتعلم أن الله خلق الإنسان في أحسن صورة، وأن كل عضو له وظيفة عظيمة، ونشكره بطاعته، والمحافظة على نعمته، واستعمالها فيما يرضيه.",
    },
  ];

  @override
  Widget build(BuildContext context) {
    return Column(
      mainAxisSize: MainAxisSize.min,
      children: faqs.map((faq) {
        return Card(
          margin: const EdgeInsets.symmetric(horizontal: 12, vertical: 6),
          child: ExpansionTile(
            leading: const Icon(Icons.question_answer),
            title: Text(faq["question"]!),
            children: [
              Padding(
                padding: const EdgeInsets.all(16),
                child: Text(faq["answer"]!),
              ),
            ],
          ),
        );
      }).toList(),
    );
  }
}
