import 'package:haya_nomen/models/quest.dart';

List<Question> questions = [
  Question(
    question: "ما أعظم نعمة يعتمد عليها جميع الكائنات الحية؟",
    answers: ["الهواء", "الماء", "البصر", "الطعام"],
    correctAnswer: 1,
  ),

  Question(
    question: "أي عضو يساعد الإنسان على الإمساك بالأشياء بدقة؟",
    answers: ["الفم", "الأنف", "الإبهام", "العين"],
    correctAnswer: 2,
  ),

  Question(
    question: "أي مخلوق ينتج العسل؟",
    answers: ["النحل", "الدود", "الدب", "النمل"],
    correctAnswer: 0,
  ),

  Question(
    question: "ما النعمة التي تمكننا من رؤية العالم؟",
    answers: ["العقل", "الصحة", "التنفس", "البصر"],
    correctAnswer: 3,
  ),

  Question(
    question: "ما الهدف من التأمل في خلق الله؟",
    answers: ["شكر الله وزيادة الإيمان", "التأمل", "البحث و التعلم", "بلا هدف"],
    correctAnswer: 0,
  ),

  Question(
    question: "ماذا تدعو الآيات الكونية الإنسان إلى؟",
    answers: ["النوم", "اللعب", "السفر", "التفكر بنعمة الله و قدرته"],
    correctAnswer: 3,
  ),

  Question(
    question: "وَخَلَقَ الْجَانَّ مِنْ ______ مِنْ نَارٍ",
    answers: ["حمم", "نيزك", "هارج", "مارج"],
    correctAnswer: 3,
  ),

  Question(
    question: "وَجَعَلْنَا مِنَ ______ كُلَّ شَيْءٍ حَيٍّ",
    answers: ["العسل", "الموت", "الْمَاءِ", "الحًيٍاةَ"],
    correctAnswer: 2,
  ),

  Question(
    question: "ماذا يحدث لو اختفت الجاذبية؟",
    answers: [
      "تبقى الأشياء ثابتة",
      "تطفو الأشياء في كل مكان",
      "يختفي الهواء",
      "تصبح الأرض أكبر",
    ],
    correctAnswer: 1,
  ),

  Question(
    question: "لماذا يتعاقب الليل والنهار؟",
    answers: ["بسبب دوران الأرض", "بسبب القمر", "بسبب الرياح", "بسبب الغيوم"],
    correctAnswer: 0,
  ),

  Question(
    question: "من خلق السماوات والأرض؟",
    answers: ["الطبيعة", "الله سبحانه و تعالى", "الإنسان", "النجوم"],
    correctAnswer: 1,
  ),

  Question(
    question: "ماذا يجب على المسلم تجاه نعم الله؟",
    answers: [
      "شكر الله والمحافظة عليها",
      "إهمالها",
      "الإسراف فيها",
      "استخدامها في المعاصي",
    ],
    correctAnswer: 0,
  ),
  Question(
    question: "من الذي أنزل المطر؟",
    answers: ["السحب", "الرياح", "الله تعالى", "الشمس"],
    correctAnswer: 2,
  ),

  Question(
    question: "ما الذي يجعل الماء يتبخر؟",
    answers: ["الثلج", "حرارة الشمس", "القمر", "الأشجار"],
    correctAnswer: 1,
  ),

  Question(
    question: "بعد أن يتبخر الماء فإنه...",
    answers: [
      "يختفي إلى الأبد",
      "يصبح ترابًا",
      "يصعد إلى السماء",
      "يتحول إلى حجر",
    ],
    correctAnswer: 2,
  ),

  Question(
    question: "تتجمع قطرات الماء لتكون؟",
    answers: ["جبلاً", "شجرة", "سحابة", "صخرة"],
    correctAnswer: 2,
  ),

  Question(
    question: "قال تعالى: ﴿وَنَزَّلْنَا مِنَ السَّمَاءِ مَاءً ...﴾ أكمل الآية.",
    answers: ["باردًا", "مالحًا", "طهورًا", "عذبًا"],
    correctAnswer: 2,
  ),

  Question(
    question: "قال تعالى: ﴿وَجَعَلْنَا مِنَ الْمَاءِ كُلَّ شَيْءٍ ...﴾",
    answers: ["حي", "طهور", "نبات", "بحرًا"],
    correctAnswer: 0,
  ),

  Question(
    question: "أي ترتيب صحيح لرحلة قطرة الماء؟",
    answers: [
      "تتبخر ← تتجمع في السحب ← تنزل مطرًا ← تعود إلى البحر",
      "تنزل مطرًا ← تتبخر ← تعود إلى البحر ← تتجمع في السحب",
      "تعود إلى البحر ← تنزل مطرًا ← تتبخر ← تتجمع في السحب",
      "تتجمع في السحب ← تعود إلى البحر ← تتبخر ← تنزل مطرًا",
    ],
    correctAnswer: 0,
  ),

  Question(
    question:
        "صح أم خطأ: الماء الذي نشربه قد يكون مرَّ برحلات كثيرة منذ آلاف السنين.",
    answers: ["صح", "خطأ"],
    correctAnswer: 0,
  ),

  Question(
    question: "﴿لَوْ نَشَاءُ جَعَلْنَاهُ أُجَاجًا﴾، معنى أُجَاجًا",
    answers: ["شديد الحرارة", "شديد الملوحة", "بارد", "عذب"],
    correctAnswer: 1,
  ),

  Question(
    question: "كان النبي ﷺ عند نزول المطر يقول:",
    answers: [
      "مطرنا بفضل الله ورحمته",
      "اللهم صيبًا نافعًا",
      "الحمد لله رب العالمين",
      "سبحان الله",
    ],
    correctAnswer: 0,
  ),

  Question(
    question:
        "إذا توقف نزول الأمطار لسنة كاملة، فأول ما سيختفي هو السيارات لاختفاء الوقود.",
    answers: ["صح", "خطأ"],
    correctAnswer: 1,
  ),

  Question(
    question: "أول من يتأثر باختفاء النباتات هي البحار والمحيطات.",
    answers: ["صح", "خطأ"],
    correctAnswer: 1,
  ),

  Question(
    question:
        "أي العبارات أقرب لمعنى الآية؟ : ﴿أَفَرَءَیۡتُمُ ٱلۡمَاۤءَ ٱلَّذِی تَشۡرَبُونَ﴾",
    answers: [
      "الغيوم تعمل من تلقاء نفسها.",
      "الله هو الذي ينزل الماء الذي نشربه.",
      "نستعمل الماء فقط للشرب.",
      "يجب فحص الماء قبل شربه.",
    ],
    correctAnswer: 1,
  ),

  Question(
    question: "ماذا علمنا النبي ﷺ أن نقول إذا سمعنا صوت الرعد؟",
    answers: [
      "سبوح قدوس رب الملائكة والروح",
      "سبحان الذي يسبح الرعد بحمده والملائكة من خيفته",
      "الحمد لله الذي جعله عذبًا فراتًا",
      "سبحان الله وبحمده سبحان الله العظيم",
    ],
    correctAnswer: 1,
  ),

  Question(
    question: "إذا بدأ المطر بغزارة، فبماذا تدعو؟",
    answers: [
      "اللهم صيبًا نافعًا",
      "ربنا ما خلقت هذا باطلًا",
      "اللهم قنا عذابك",
      "ربنا آتنا في الدنيا حسنة",
    ],
    correctAnswer: 0,
  ),

  Question(
    question: "قال أحدهم: المنخفض الجوي هو الذي أنزل المطر، كيف تصحح كلامه؟",
    answers: [
      "المنخفض هو السبب.",
      "المطر ينزل بلا سبب.",
      "تكاثف الغيوم وحده ينزل المطر.",
      "الله هو الذي أنزل المطر، والمنخفض سبب من الأسباب.",
    ],
    correctAnswer: 3,
  ),
  Question(
    question: "صح أم خطأ: الله علّم الإنسان البيان سواءً بالنطق أو الكتابة.",
    answers: ["صح", "خطأ"],
    correctAnswer: 0,
  ),

  Question(
    question:
        "صح أم خطأ: مخالب الأسد تمكنه من الكتابة قريبًا من مهارة الإنسان.",
    answers: ["صح", "خطأ"],
    correctAnswer: 1,
  ),

  Question(
    question: "صح أم خطأ: قرد الشمبانزي له القدرة على الرسم الدقيق.",
    answers: ["صح", "خطأ"],
    correctAnswer: 1,
  ),

  Question(
    question:
        "صح أم خطأ: بصمات أصابع الإنسان لا تتطابق أبداً حتى عند التوأمين.",
    answers: ["صح", "خطأ"],
    correctAnswer: 0,
  ),

  Question(
    question: "ما الإصبع الذي يساعدنا أكثر على قبض الأشياء بقوة؟",
    answers: ["السبابة", "الخنصر", "الإبهام", "البنصر"],
    correctAnswer: 2,
  ),

  Question(
    question: "أي إصبع له دور مهم في الإمساك بالأشياء الدقيقة مثل مشرط الجراح؟",
    answers: ["البنصر", "الوسطى", "السبابة", "الإبهام"],
    correctAnswer: 3,
  ),

  Question(
    question: "بماذا أقسم الله في سورة القلم؟",
    answers: ["الشمس", "الليل", "القلم", "البحر"],
    correctAnswer: 2,
  ),

  Question(
    question: "ما الشيء الذي يصعب فعله بدون الإبهام؟",
    answers: ["الكتابة", "فتح علبة", "ربط الحذاء", "جميع ما سبق"],
    correctAnswer: 3,
  ),

  Question(
    question:
        "قال تعالى: ﴿ٱلَّذِي عَلَّمَ بِٱلْقَلَمِ﴾، تشير الآية إلى نعمة...",
    answers: ["السباحة", "الزراعة", "الكتابة", "الطبخ"],
    correctAnswer: 2,
  ),

  Question(
    question: "لماذا لا يكتب قرد الشمبانزي رغم امتلاكه إبهامًا؟",
    answers: [
      "يحب الرسم ولا يحب الكتابة",
      "لا يوجد أقلام في الغابة",
      "إبهامه ليس له قدرة على الإمساك بالأشياء الدقيقة والتحكم بها",
      "يمشي على يديه ورجليه",
    ],
    correctAnswer: 2,
  ),

  Question(
    question: "أي العلوم والفنون ستتأثر بفقد أصبع الإبهام؟",
    answers: [
      "الجراحة الدقيقة",
      "كتابة المصحف",
      "صناعة الساعات",
      "جميع ما سبق",
    ],
    correctAnswer: 3,
  ),

  Question(
    question: "إذا فقد الإنسان إحدى النعم، ماذا سيدرك؟",
    answers: [
      "أنه لا يحتاجها",
      "أنها لا تؤثر في حياته",
      "أنها غير مفيدة",
      "أهمية تلك النعمة",
    ],
    correctAnswer: 3,
  ),
];
